ClarePhang/cc2650_easy_link_example_BEng_Final_Project/source/apps/components/driverlib/inc/pg1/hw_cm3_tpiu.h
#define CM3_TPIU_TPIU_FFSR_TCPRESENT_M \
                                0x00000004
#define CM3_TPIU_TPIU_FFSR_TCPRESENT_S 2
#define CM3_TPIU_TPIU_FFSR_FTSTOPPED \
                                0x00000002  // This bit always reads as zero 

#define CM3_TPIU_TPIU_FFSR_FTSTOPPED_M \
                                0x00000002
#define CM3_TPIU_TPIU_FFSR_FTSTOPPED_S 1
#define CM3_TPIU_TPIU_FFSR_FLINPROG \
                                0x00000001  // This bit always reads as zero 

#define CM3_TPIU_TPIU_FFSR_FLINPROG_M \
                                0x00000001
#define CM3_TPIU_TPIU_FFSR_FLINPROG_S 0
//*****************************************************************************
//
// The following are defines for the bit fields in the 
// CM3_TPIU_O_TPIU_FFCR register.
//
//*****************************************************************************
#define CM3_TPIU_TPIU_FFCR_STOPTRIG \
                                0x00002000  // Stop the formatter after a 
                                            // Trigger Event is observed. 

#define CM3_TPIU_TPIU_FFCR_STOPTRIG_M \
                                0x00002000
#define CM3_TPIU_TPIU_FFCR_STOPTRIG_S 13
#define CM3_TPIU_TPIU_FFCR_STOPFI \
                                0x00001000  // Stop the formatter after a 
                                            // flush completes. 

#define CM3_TPIU_TPIU_FFCR_STOPFI_M \
                                0x00001000
#define CM3_TPIU_TPIU_FFCR_STOPFI_S 12
#define CM3_TPIU_TPIU_FFCR_TRIGFI \
                                0x00000400  // Indicates a trigger on Flush 
                                            // completion. 

#define CM3_TPIU_TPIU_FFCR_TRIGFI_M \
                                0x00000400
#define CM3_TPIU_TPIU_FFCR_TRIGFI_S 10
#define CM3_TPIU_TPIU_FFCR_TRIGEVT \
                                0x00000200  // Indicate a trigger on a Trigger 
                                            // Event. 

#define CM3_TPIU_TPIU_FFCR_TRIGEVT_M \
                                0x00000200
#define CM3_TPIU_TPIU_FFCR_TRIGEVT_S 9
#define CM3_TPIU_TPIU_FFCR_TRIGIN \
                                0x00000100  // Indicate a trigger on TRIGIN 
                                            // being asserted. 

#define CM3_TPIU_TPIU_FFCR_TRIGIN_M \
                                0x00000100
#define CM3_TPIU_TPIU_FFCR_TRIGIN_S 8
#define CM3_TPIU_TPIU_FFCR_FONMAN \
                                0x00000040  // Manually generate a flush of 
                                            // the system. 

#define CM3_TPIU_TPIU_FFCR_FONMAN_M \
                                0x00000040
#define CM3_TPIU_TPIU_FFCR_FONMAN_S 6
#define CM3_TPIU_TPIU_FFCR_FONTRIG \
                                0x00000020  // Generate flush using Trigger 
                                            // event. 

#define CM3_TPIU_TPIU_FFCR_FONTRIG_M \
                                0x00000020
#define CM3_TPIU_TPIU_FFCR_FONTRIG_S 5
#define CM3_TPIU_TPIU_FFCR_FONFLLN \
                                0x00000010  // Generate flush using the 
                                            // FLUSHIN interface. 

#define CM3_TPIU_TPIU_FFCR_FONFLLN_M \
                                0x00000010
#define CM3_TPIU_TPIU_FFCR_FONFLLN_S 4
#define CM3_TPIU_TPIU_FFCR_ENFCONT \
                                0x00000002  // Continuous Formatting, no 
                                            // TRACECTL. This bit is set on 
                                            // reset. 

#define CM3_TPIU_TPIU_FFCR_ENFCONT_M \
                                0x00000002
#define CM3_TPIU_TPIU_FFCR_ENFCONT_S 1
#define CM3_TPIU_TPIU_FFCR_ENFTC \
                                0x00000001  // Enable Formatting. Because 
                                            // TRACECTL is never present, this 
                                            // bit reads as zero. 

#define CM3_TPIU_TPIU_FFCR_ENFTC_M \
                                0x00000001
#define CM3_TPIU_TPIU_FFCR_ENFTC_S 0
//*****************************************************************************
//
// The following are defines for the bit fields in the 
// CM3_TPIU_O_TPIU_FSCR register.
//
//*****************************************************************************
#define CM3_TPIU_TPIU_FSCR_TPIU_FSCR_M \
                                0xFFFFFFFF  // Formatter Synchronization 
                                            // Counter Register. The global 
                                            // synchronization trigger is 
                                            // generated by the Program Counter 
                                            // (PC) Sampler block. This means 
                                            // that there is no synchronization 
                                            // counter in the TPIU. 

#define CM3_TPIU_TPIU_FSCR_TPIU_FSCR_S 0
//*****************************************************************************
//
// The following are defines for the bit fields in the 
// CM3_TPIU_O_TRIGGER register.
//
//*****************************************************************************
#define CM3_TPIU_TRIGGER_TRIGGER_INPUT_VALUE \
                                0x00000001  // Enables the TRIGGER input 

#define CM3_TPIU_TRIGGER_TRIGGER_INPUT_VALUE_M \
                                0x00000001
#define CM3_TPIU_TRIGGER_TRIGGER_INPUT_VALUE_S 0
//*****************************************************************************
//
// The following are defines for the bit fields in the 
// CM3_TPIU_O_FIFO_DATA_0 register.
//
//*****************************************************************************
#define CM3_TPIU_FIFO_DATA_0_ATVALID2S \
                                0x20000000  

#define CM3_TPIU_FIFO_DATA_0_ATVALID2S_M \
                                0x20000000
#define CM3_TPIU_FIFO_DATA_0_ATVALID2S_S 29
#define CM3_TPIU_FIFO_DATA_0_WRITE_POINT_2_M \
                                0x18000000  

#define CM3_TPIU_FIFO_DATA_0_WRITE_POINT_2_S 27
#define CM3_TPIU_FIFO_DATA_0_ATVALID1S \
                                0x04000000  

#define CM3_TPIU_FIFO_DATA_0_ATVALID1S_M \
                                0x04000000
#define CM3_TPIU_FIFO_DATA_0_ATVALID1S_S 26
#define CM3_TPIU_FIFO_DATA_0_WRITE_POINT_1_M \
                                0x03000000  

#define CM3_TPIU_FIFO_DATA_0_WRITE_POINT_1_S 24
#define CM3_TPIU_FIFO_DATA_0_FIFO1_DATA_2_M \
                                0x00FF0000  

#define CM3_TPIU_FIFO_DATA_0_FIFO1_DATA_2_S 16
#define CM3_TPIU_FIFO_DATA_0_FIFO1_DATA_1_M \
                                0x0000FF00  

#define CM3_TPIU_FIFO_DATA_0_FIFO1_DATA_1_S 8
#define CM3_TPIU_FIFO_DATA_0_FIFO1_DATA_0_M \
                                0x000000FF  

#define CM3_TPIU_FIFO_DATA_0_FIFO1_DATA_0_S 0
//*****************************************************************************
//
// The following are defines for the bit fields in the 
// CM3_TPIU_O_ITATBCTR2 register.
//
//*****************************************************************************
#define CM3_TPIU_ITATBCTR2_ATREADY1_ATREADY2 \
                                0x00000001  // This bit reads or sets the 
                                            // value of ATREADYS1 and 
                                            // ATREADYS2. 

#define CM3_TPIU_ITATBCTR2_ATREADY1_ATREADY2_M \
                                0x00000001
#define CM3_TPIU_ITATBCTR2_ATREADY1_ATREADY2_S 0
//*****************************************************************************
//
// The following are defines for the bit fields in the 
// CM3_TPIU_O_ITATBCTR0 register.
//
//*****************************************************************************
#define CM3_TPIU_ITATBCTR0_ATVALID1_ATVALID2 \
                                0x00000001  // This bit reads or sets the 
                                            // value of ATVALIDS1 OR-ed with 
                                            // ATVALIDS2. 

#define CM3_TPIU_ITATBCTR0_ATVALID1_ATVALID2_M \
                                0x00000001
#define CM3_TPIU_ITATBCTR0_ATVALID1_ATVALID2_S 0
//*****************************************************************************
//
// The following are defines for the bit fields in the 
// CM3_TPIU_O_FIFO_DATA_1 register.
//
//*****************************************************************************
#define CM3_TPIU_FIFO_DATA_1_ATVALID2S \
                                0x20000000  

