ClarePhang/cc2650_easy_link_example_BEng_Final_Project/source/apps/components/driverlib/inc/pg1/hw_cm3_tpiu.h
#define CM3_TPIU_FIFO_DATA_1_ATVALID2S_M \
                                0x20000000
#define CM3_TPIU_FIFO_DATA_1_ATVALID2S_S 29
#define CM3_TPIU_FIFO_DATA_1_WRITE_POINT_2_M \
                                0x18000000  

#define CM3_TPIU_FIFO_DATA_1_WRITE_POINT_2_S 27
#define CM3_TPIU_FIFO_DATA_1_ATVALID1S \
                                0x04000000  

#define CM3_TPIU_FIFO_DATA_1_ATVALID1S_M \
                                0x04000000
#define CM3_TPIU_FIFO_DATA_1_ATVALID1S_S 26
#define CM3_TPIU_FIFO_DATA_1_WRITE_POINT_1_M \
                                0x03000000  

#define CM3_TPIU_FIFO_DATA_1_WRITE_POINT_1_S 24
#define CM3_TPIU_FIFO_DATA_1_FIFO2_DATA_2_M \
                                0x00FF0000  

#define CM3_TPIU_FIFO_DATA_1_FIFO2_DATA_2_S 16
#define CM3_TPIU_FIFO_DATA_1_FIFO2_DATA_1_M \
                                0x0000FF00  

#define CM3_TPIU_FIFO_DATA_1_FIFO2_DATA_1_S 8
#define CM3_TPIU_FIFO_DATA_1_FIFO2_DATA_0_M \
                                0x000000FF  

#define CM3_TPIU_FIFO_DATA_1_FIFO2_DATA_0_S 0
//*****************************************************************************
//
// The following are defines for the bit fields in the 
// CM3_TPIU_O_ITCTRL register.
//
//*****************************************************************************
#define CM3_TPIU_ITCTRL_FIFO_TEST_MODE \
                                0x00000002  // Enables FIFO test mode 

#define CM3_TPIU_ITCTRL_FIFO_TEST_MODE_M \
                                0x00000002
#define CM3_TPIU_ITCTRL_FIFO_TEST_MODE_S 1
#define CM3_TPIU_ITCTRL_INTEGRATION_TEST_MODE \
                                0x00000001  // Enables integration test mode 

#define CM3_TPIU_ITCTRL_INTEGRATION_TEST_MODE_M \
                                0x00000001
#define CM3_TPIU_ITCTRL_INTEGRATION_TEST_MODE_S 0
//*****************************************************************************
//
// The following are defines for the bit fields in the 
// CM3_TPIU_O_CLAIMSET register.
//
//*****************************************************************************
#define CM3_TPIU_CLAIMSET_CLAIMSET_M \
                                0xFFFFFFFF  // Claim tag set register. This 
                                            // register forms one half of the 
                                            // Claim Tag value. This location 
                                            // enables individual bits to be 
                                            // cleared and returns the current 
                                            // Claim Tag value. Read: Current 
                                            // Claim Tag Value. Write: Each bit 
                                            // is considered separately. 0 = no 
                                            // effect. 1 = clear this bit in 
                                            // the claim tag. 

#define CM3_TPIU_CLAIMSET_CLAIMSET_S 0
//*****************************************************************************
//
// The following are defines for the bit fields in the 
// CM3_TPIU_O_CLAIMCLR register.
//
//*****************************************************************************
#define CM3_TPIU_CLAIMCLR_CLAIMCLR_M \
                                0xFFFFFFFF  // Claim tag clear register. This 
                                            // register forms one half of the 
                                            // Claim Tag value. This location 
                                            // enables individual bits to be 
                                            // set and returns the number of 
                                            // bits that can be set. Read: Each 
                                            // bit is considered separately. 0 
                                            // = this claim tag bit is not 
                                            // implemented. 1 = this claim tag 
                                            // bit is implemented. Write: Each 
                                            // bit is considered separately. 0 
                                            // = no effect. 1 = set this bit in 
                                            // the claim tag. 

#define CM3_TPIU_CLAIMCLR_CLAIMCLR_S 0
//*****************************************************************************
//
// The following are defines for the bit fields in the 
// CM3_TPIU_O_DEVID register.
//
//*****************************************************************************
#define CM3_TPIU_DEVID_DEVID_M  0xFFFFFFFF  // Device ID register. This 
                                            // register returns: 0xCA1 if there 
                                            // is an ETM present. 0xCA0 if 
                                            // there is no ETM present. 
#define CM3_TPIU_DEVID_DEVID_S  0
//*****************************************************************************
//
// The following are defines for the bit fields in the 
// CM3_TPIU_O_PID4 register.
//
//*****************************************************************************
#define CM3_TPIU_PID4_PID4_M    0xFFFFFFFF  // Peripheral identification 
                                            // register (PID4). 
#define CM3_TPIU_PID4_PID4_S    0
//*****************************************************************************
//
// The following are defines for the bit fields in the 
// CM3_TPIU_O_PID5 register.
//
//*****************************************************************************
#define CM3_TPIU_PID5_PID5_M    0xFFFFFFFF  // Peripheral identification 
                                            // register (PID5). 
#define CM3_TPIU_PID5_PID5_S    0
//*****************************************************************************
//
// The following are defines for the bit fields in the 
// CM3_TPIU_O_PID6 register.
//
//*****************************************************************************
#define CM3_TPIU_PID6_PID6_M    0xFFFFFFFF  // Peripheral identification 
                                            // register (PID6). 
#define CM3_TPIU_PID6_PID6_S    0
//*****************************************************************************
//
// The following are defines for the bit fields in the 
// CM3_TPIU_O_PID7 register.
//
//*****************************************************************************
#define CM3_TPIU_PID7_PID7_M    0xFFFFFFFF  // Peripheral identification 
                                            // register (PID7). 
#define CM3_TPIU_PID7_PID7_S    0
//*****************************************************************************
//
// The following are defines for the bit fields in the 
// CM3_TPIU_O_PID0 register.
//
//*****************************************************************************
#define CM3_TPIU_PID0_PID0_M    0xFFFFFFFF  // Peripheral identification 
                                            // register Bits 7:0 (PID0). 
#define CM3_TPIU_PID0_PID0_S    0
//*****************************************************************************
//
// The following are defines for the bit fields in the 
// CM3_TPIU_O_PID1 register.
//
//*****************************************************************************
#define CM3_TPIU_PID1_PID1_M    0xFFFFFFFF  // Peripheral identification 
                                            // register Bits 15:8 (PID1). 
#define CM3_TPIU_PID1_PID1_S    0
//*****************************************************************************
//
// The following are defines for the bit fields in the 
// CM3_TPIU_O_PID2 register.
//
//*****************************************************************************
#define CM3_TPIU_PID2_PID2_M    0xFFFFFFFF  // Peripheral identification 
                                            // register Bits 23:16 (PID2). 
#define CM3_TPIU_PID2_PID2_S    0
//*****************************************************************************
//
// The following are defines for the bit fields in the 
// CM3_TPIU_O_PID3 register.
//
//*****************************************************************************
#define CM3_TPIU_PID3_PID3_M    0xFFFFFFFF  // Peripheral identification 
                                            // register Bits 31:24 (PID3). 
#define CM3_TPIU_PID3_PID3_S    0
//*****************************************************************************
//
// The following are defines for the bit fields in the 
// CM3_TPIU_O_CID0 register.
//
//*****************************************************************************
#define CM3_TPIU_CID0_CID0_M    0xFFFFFFFF  // Component identification 
                                            // register Bits 7:0 (CID0). 
#define CM3_TPIU_CID0_CID0_S    0
//*****************************************************************************
//
// The following are defines for the bit fields in the 
// CM3_TPIU_O_CID1 register.
//
//*****************************************************************************
#define CM3_TPIU_CID1_CID1_M    0xFFFFFFFF  // Component identification 
                                            // register Bits 15:8 (CID1). 
#define CM3_TPIU_CID1_CID1_S    0
//*****************************************************************************
//
// The following are defines for the bit fields in the 
// CM3_TPIU_O_CID2 register.
//
//*****************************************************************************
#define CM3_TPIU_CID2_CID2_M    0xFFFFFFFF  // Component identification 
                                            // register Bits 23:16 (CID2). 
#define CM3_TPIU_CID2_CID2_S    0
//*****************************************************************************
//
// The following are defines for the bit fields in the 
// CM3_TPIU_O_CID3 register.
//
//*****************************************************************************
#define CM3_TPIU_CID3_CID3_M    0xFFFFFFFF  // Component identification 
                                            // register Bits 31:24 (CID3). 
#define CM3_TPIU_CID3_CID3_S    0


#endif // __HW_CM3_TPIU_H__

